#输入空气质量指数
aqi = float(input("请输入空气质量指数AQI："))
print()

jb = ["一级", "二级", "三级", "四级", "五级", "六级"]
wr = ["优", "良", "轻度污染", "中度污染", "重度污染", "严重污染"]
jy = ["空气质量优，各类人群可户外正常活动",
      "空气质量良，少数敏感人群减少户外运动",
      "空气轻度污染，减少长时间户外运动" ,
      "空气中度污染，应适量减少户外运动",
      "空气重度污染，一般人减少户外运动",
      "空气严重污染，一般人避免户外运动。"
      ]

#判断并输出建议
if aqi>300:
    print("**************空气质量指数AQI监测系统**************")
    print("AQI级别：", jb[5])
    print("AQI类别：", wr[5])
    print("户外活动建议：", jy[5])
    print("***************************************************")
elif aqi>200:
    print("**************空气质量指数AQI监测系统**************")
    print("AQI级别：", jb[4])
    print("AQI类别：", wr[4])
    print("户外活动建议：", jy[4])
    print("***************************************************")
elif aqi>150:
    print("**************空气质量指数AQI监测系统**************")
    print("AQI级别：", jb[3])
    print("AQI类别：", wr[3])
    print("户外活动建议：", jy[3])
    print("***************************************************")
elif aqi>100:
    print("**************空气质量指数AQI监测系统**************")
    print("AQI级别：", jb[2])
    print("AQI类别：", wr[2])
    print("户外活动建议：", jy[2])
    print("***************************************************")
elif aqi>50:
    print("**************空气质量指数AQI监测系统**************")
    print("AQI级别：", jb[1])
    print("AQI类别：", wr[1])
    print("户外活动建议：", jy[1])
    print("***************************************************")
elif aqi>=0:
    print("**************空气质量指数AQI监测系统**************")
    print("AQI级别：", jb[0])
    print("AQI类别：", wr[0])
    print("户外活动建议：", jy[0])
    print("***************************************************")
else:
    print("请输入正确的空气质量指数！")




