#输入空气质量指数
aqi = float(input("请输入空气质量指数AQI："))
print()

#判断并输出建议
if aqi>=0 and aqi<=50:
    jb = "一级"
    wr = "优"
    jy = "空气质量优，各类人群可户外正常活动。"
elif aqi>50 and aqi<=100:
    jb = "二级"
    wr = "良"
    jy = "空气质量良，少数敏感人群减少户外运动。"
elif aqi>100 and aqi<=150:
    jb = "三级"
    wr = "轻度污染"
    jy = "空气轻度污染，减少长时间户外运动。"
elif aqi>150 and aqi<=200:
    jb = "四级"
    wr = "中度污染"
    jy = "空气中度污染，应适量减少户外运动。"
elif aqi>200 and aqi<=300:
    jb = "五级"
    wr = "重度污染"
    jy = "空气重度污染，一般人减少户外运动。"
else:
    jb = "六级"
    wr = "严重污染"
    jy = "空气严重污染，一般人避免户外运动。"

# 按照指定格式输出
print("**************空气质量指数AQI监测系统**************")
print("AQI级别：", jb)
print("AQI类别：", wr)
print("户外活动建议：", jy)
print("***************************************************")


